"""
    面向对象

    基本理论
        什么是对象
            概念定义
            在Python中体现
        面向过程&面向对象
            两种编程思想的对比 以及侧重
            如何从面向过程过渡到面向对象
            面向对象编程的技巧
        类
            类的概念 作用以及组成
            生活中类的案例
            对象和类的关系

    面向对象在python中的实现
            怎样定义一个类
            怎样通过类 实例化一个对象
            属性相关
                    如何增删查改对象属性&类属性
                    二者之间的对比集内存存储差异
                    属性高级操作
                        限定
                        权限控制
            方法补充
                    如何操作实例方法 类方法  静态方法
                    这几种类型的方法对比和使用场景
                    重难点讲解
                    方法的私有化

            元类（补充）

    Python对象的声明周期以及周期方法

    面向对象编程综合案例

    面向对象的三大特性
        封装
        继承
        多态
        每个特性锁延展出来的技术点

    三大特性  综合案例

    常用设计模式
            单例
            工厂

    开发经验补充
            类的设计原则
                    单一职责
                    迪米特法则
                    开闭原则
                    ...
            命名规范
                    类名
                    方法名
                    属性名




"""





































