"""
    深浅拷贝就是复制一份，也就是抄一份
    深浅拷贝
        其实就是完全复制一份，
        和部分复制一份的意思
"""

l1 = [1, 2, 3, ['barry', 'alex']]
l2 = l1

print(l1)  # [111, 2, 3, ['barry', 'alex']]
print(l2)  # [111, 2, 3, ['barry', 'alex']]

l1[3][0] = 'lcwspr'
print(l1)  # [111, 2, 3, ['lcwspr', 'alex']]
print(l2)  # [111, 2, 3, ['lcwspr', 'alex']]


# 浅拷贝
#同一代码块下：
l1 = [1, '太白', True, (1,2,3), [22, 33]]
l2 = l1.copy()
print(id(l1), id(l2))          # 2713214468360 2713214524680
print(id(l1[-2]), id(l2[-2]))  # 2547618888008 2547618888008
print(id(l1[-1]),id(l2[-1]))   # 2547620322952 2547620322952



# 深拷贝

# 同一代码块下
import copy
l1 = [1, 'alex', True, (1,2,3), [22, 33]]
l2 = copy.deepcopy(l1)
print(id(l1), id(l2))  # 2788324482440 2788324483016
print(id(l1[0]),id(l2[0]))  # 1470562768 1470562768
print(id(l1[-1]),id(l2[-1]))  # 2788324482632 2788324482696
print(id(l1[-2]),id(l2[-2]))  # 2788323047752 2788323047752


# test
l1 = [1, 2, 3, 4, ['lcwspr', ]]
l2 = l1[:]
l1[-1].append('y666')
print(l2)