"""
    包和模块的分类
            标准包/模块
                安装Python后自动帮我们安装好的一些模块 可以直接导入使用
                每个安装Python的用户电脑上都有这些模块
                    在你电脑上写的使用某个系统模块的代码   到其他人电脑上  同样能够运行
                满足我们基本的功能需求

                import os
                os.path

                特殊的     内建的包和模块                    python2   _builtin_
                        当我们在编码的过程中 Python自动帮我们导入的模块   builtins
                        我们使用这些功能的时候  不需要手动导入该模块 直接就可以使用

                查看模块中包含哪些东西    dir(_builtin_)



            三方包/模块
                        有些功能 系统模块没有实现 或者实现了  但我们使用起来比较复杂
                        就有开发人员  开发了一些使用更加方便的模块 供其他人员使用
                                有可能也使用到了系统的某些模块   有可能也没有使用

                        其他开发人员  需要下载安装才能使用
                                如果你的代码使用了某个三方模块 到时候把代码拷贝给被人
                                别人也需要安装同样的三方模块才能运行


            自定义包/模块
                        我们自己写的一些好用的模块
                        发布出去给别人使用 就变成了  三方模块
                        



"""



































